Repository: haruyama/ssh_rfc_ja
Catalog: omegat/ssh/ssh-level2.tmx
Source language: en_us
Languages: ja

source: For this to be possible, the client must have a priori knowledge of the server's public host key.
ja: これを可能にするために, クライアントはサーバの公開ホスト鍵をあらかじめ知っておく必要がある.

source: It runs over the transport layer protocol.
ja: このプロトコルはトランスポート層プロトコル上で動作する.

source: All implementations of AES-GCM secure shell MUST use the full 16-octet Authentication Tag.
ja: AES-GCM のすべての実装は, 完全な 16-オクテットの認証タグを用いなければならない.

source: One property of counter mode encryption is that it does not require that messages be padded to a multiple of the block cipher's block length.
ja: カウンターモード暗号化の特徴の1つは, ブロック暗号のブロック長の倍数にメッセージをパディングする必要がないことだ.

source: Although the example shows the NETCONF server sending a <hello> message followed by the NETCONF client's <hello> message, both sides will send the message as soon as the NETCONF subsystem is initialized, perhaps simultaneously.
ja: 例では <hello> メッセージの NETCONF サーバの送信に続いて NETCONF クライアントのメッセージが続いているが, NETCONF サブシステムが開始されたらすぐに, おそらく同時に, どちらの側からもメッセージが送られる.

source: If it were to offer the public key of the server, then it would not be able to decrypt or sign the transmissions between the legitimate server and the client unless it also had access to the private key of the host.
ja: デバイスが正当なサーバの公開鍵を提供すると, 正当なサーバの秘密鍵にアクセスできなければ通信の復号や署名ができない.

source: For this reason, it must be emphasized that peers MUST rekey before a wrap of the sequence numbers.
ja: このため, シーケンス番号が繰り返される前にピアは鍵の再作成をしなければならないことが強調されなければならない.

source: Client implementations SHOULD reject direct TCP/IP open requests for security reasons.
ja: クライアントの実装は, セキュリティ上の理由により direct TCP/IP の開始要求を拒否する必要がある.

source: *Verify host key belongs to server.
ja: *ホスト鍵がサーバのものか検証

source: Pseudo-Terminal Encoded Terminal Modes ....................10 4.5.1.
ja: 擬似ターミナルの Encoded Terminal Modes...............10 4.5.1.

source: The SSHFP Resource Record .......................................3 3.1.
ja: SSHFP リソースレコード .......................................3 3.1.

source: Secure Shell Binary Packets ................................5 6.
ja: セキュアシェルのバイナリパケット ................................5 6.

source: In order to distribute the fingerprint using DNS, this document defines a new DNS resource record, "SSHFP", to carry the fingerprint.
ja: DNS を用いて指紋を配布するために, 指紋を伝達する "SSHFP" という新しいDNS リソースレコードをこの文書は定義する.

source: In the Public Key Algorithm Names registry: The family of SSH public key algorithm names beginning with "ecdsa-sha2-" and not containing the at-sign ('@'), to name the public key algorithms defined in Section 3.
ja: 公開鍵アルゴリズム名レジストリに: "ecdsa-sha2-" で始まり アットマーク('@')を含まない SSH公開鍵アルゴリズム名のファミリを, 3節で定義した公開鍵アルゴリズムを指定するために登録.

source: SSH_MSG_CHANNEL_REQUEST messages with a "pty-req" string MUST contain 'encoded terminal modes'.
ja: "ptr-req" string を含む SSH_MSG_CHANNEL_REQUEST メッセージは, 'encoded terminal modes' を含まなければならない.

source: This is followed by the message exchange described above in Section 2.1, except that the exchange hash H is computed as the HASH hash of the concatenation of the following:
ja: 2．1 節で前述したメッセージ交換が続く． ただし， 交換ハッシュ H は， 次の連結の HASH でのハッシュとして計算される．

source: There are two Secure Shell (SSH) protocols that use public key cryptography for authentication.
ja: 認証に公開鍵暗号を用いる 2つのセキュアシェル (SSH) プロトコルがある.

source: Packet Size and Overhead ...................................6 6.
ja: パケットのサイズとオーバーヘッド.......................6 6.

source: Both sides MUST wait to receive this version before continuing.
ja: どちらの側も続行する前にこのバージョンを受け取るために待たなければならない.

source: * If the resulting major_status code is GSS_S_COMPLETE, but a non-zero-length reply token is returned, then that token is sent to the client.
ja: * 結果のmajor_status コードが GSS_S_COMPLETE だが 長さが0ではない応答トークンが返されたなら, そのトークンがクライアントに送られる.

source: It is, however, allowed to consist of multiple lines separated by CRLF (Carriage Return - Line Feed) pairs.
ja: しかし, CRLF (キャリッジリターン - ラインフィード) の組で区切られた複数の行を含んでもよい.

source: Initial Exchange
ja: 最初の交換

source: Yet, the attack is possible because Record 1 has already been seen.
ja: しかし, Record 1 がすでに見られているので攻撃できる.

source: 55 ECHOK Kill character discards current line.
ja: 55 ECHOK 現在の行を捨てる Kill 文字

source: Therefore, rekeying SHOULD happen after 2**28 packets at the very most.
ja: このため, 鍵の再作成は最も多くても2**28パケットごとに行なわれる必要がある.

source: The details of how a session is opened are described in the SSH Connection Protocol document [4] in the section "Opening a Session".
ja: どのようにセッションを開始するかの詳細は, SSH コネクションプロトコル文書 [4] の 「セッションの開始」 節に記述されている.

source: Compatibility With Old SSH Versions
ja: 古い SSH のバージョンとの互換性

source: packet_length The length of the packet in bytes, not including 'mac' or the 'packet_length' field itself.
ja: packet_length byte単位のパケットの長さ. 'mac' と 'packet_length' 自体の長さは含まない.

source: Use in Public Key Algorithms .
ja: 公開鍵アルゴリズムでの利用 .

source: After obtaining the requested information from the user, the client MUST respond with an SSH_MSG_USERAUTH_INFO_RESPONSE message.
ja: ユーザから要求された情報を得たら, クライアントは, SH_MSG_USERAUTH_INFO_RESPONSE メッセージで応答する.

source: The actual number of packets exchanged is determined by the underlying GSS-API mechanism.
ja: 交換されるパケットの実際の数は， 基底のGSS-API メカニズムで決定される．

source: Given this, the server would return the "shell" attribute, with "compulsory" marked true.
ja: このとき, "compulsory" がtrue な "shell" 属性をサーバは返す.

source: A port forwarding can be canceled with the following message.
ja: ポート転送は次のメッセージでキャンセルできる.

source: This protocol is designed to be used over a reliable transport.
ja: このプロトコルは, 信頼できるトランスポート上で使われるように設計されている.

source: When flow control is allowed, it is often desirable to do the flow control at the client end to speed up responses to user requests.
ja: フロー制御が許されているなら, ユーザのリクエストに対する応答をスピードアップするためにクライアントの側でフロー制御をすることが望ましい場合がある.

source: After key exchange, the 'mac' for the selected MAC algorithm will be computed before encryption from the concatenation of packet data:
ja: 鍵交換の後で, 選択された MACによる 'mac' が, パケットデータの連結を暗号化する前に計算される.

source: This document is part of a set.
ja: この文書は, (訳注: プロトコルを定義する文書の)集合の一部分だ.

source: For all of the public key algorithms specified in this document, the key format consists of a sequence of one or more X.509v3 certificates followed by a sequence of 0 or more Online Certificate Status Protocol (OCSP) responses as in Section 4.2 of [RFC2560].
ja: この文書で指定される公開鍵アルゴリズムのすべてで, [RFC2560] の 4.2節にある Online Certificate Status Protocol (OCSP) 応答が 0 以上後に続く X.509v3 証明書の 1つ以上のシーケンスによって, 鍵のフォーマットは構成される.

source: Since the sequence_number is, up to an additive constant, just the low 32 bits of the invocation_counter, the presence of the invocation_counter field in the IV ensures that the sequence_number is indeed involved in the formation of the integrity tag, though this involvement differs slightly from the requirements in Section 6.4 of [RFC4253].
ja: sequence_number は, 追加の定数次第で, invocation_counter の丁度下位 32 ビットなので, invocation_counter フィールドがIVに存在していることは, sequence_number 自体が完全性タグの形成に実際に関与していることになる. この関与は, [RFC4253] の 6.4節の要件と少し異なっている.

source: Implementation of this specification requires familiarity with both SSH [RFC4251] [RFC4253] [RFC4250] and ECC [SEC1] (additional information on ECC available in [HMV04], [ANSI-X9.62], and [ANSI-X9.63]).
ja: この仕様の実装は, SSH [RFC4251] [RFC4253] [RFC4250] と ECC [SEC1] ([HMV04]と [ANSI-X9.62], [ANSI-X9.63] で利用可能なECCの追加の情報) の両方に精通している必要がある.

source: Alternatively, the attacker may be able to exploit the algorithm vulnerability or weakness to find the shared secret by reviewing the MACs from captured packets.
ja: あるいは, 攻撃者はキャプチャしたパケットのMACを吟味して共有の秘密を探すのにアルゴリズムの脆弱性や弱点を利用できるかもしれない.

source: o in the SSH_MSG_KEXRSA_PUBKEY message [RFC4432]
ja: o SSH_MSG_KEXRSA_PUBKEY メッセージ内 [RFC4432]

source: It computes K = e^y mod p, H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K) (these elements are encoded according to their types; see below), and signature s on H with its private host key.
ja: K = e^y mod p と H = hash(V_C || V_S || I_C || I_S || K_S || e || f || K) を計算する (これらの要素はそれぞれの種類に従ってエンコードされる. 以下を参照). そして, ホスト秘密鍵で H に署名する. 署名の結果は s とする.

source: o The Transport Layer Protocol [SSH-TRANS] provides server authentication, confidentiality, and integrity.
ja: o トランスポート層プロトコル[SSH-TRANS] は, サーバの認証, 機密性, 完全性を提供する.

source: The window size is decremented by the amount of data sent.
ja: window size は, 転送されたデータ量だけ減少する.

source: Requests are generated from the server using the SSH_MSG_USERAUTH_INFO_REQUEST message.
ja: SSH_MSG_USERAUTH_INFO_REQUEST メッセージを用いて, サーバから要求が生成される.

source: See Section 3.1 for details.
ja: 詳細は 3.1 節を参照.

source: Generic Message Exchange Authentication for the Secure Shell Protocol (SSH)
ja: SSHプロトコル (SSH) のための 一般メッセージ交換認証

source: The minimum size of a packet is 16 (or the cipher block size, whichever is larger) bytes (plus 'mac').
ja: パケットの最小サイズは, 16(ないし暗号のブロックサイズ, どちらか大きいほう) byte に 'mac' が追加されたものだ.

source: 53 ECHO Enable echoing.
ja: 53 ECHO エコーを有効にする.

source: The primary goal of the SSH protocol is to improve security on the Internet.
ja: SSH プロトコルの第一の目標は, インターネットのセキュリティを向上することだ.

source: Extended Channel Data Transfer 'data_type_code' values in that range are left for PRIVATE USE, as described in [RFC2434].
ja: この範囲の拡張チャンネルデータ転送の 'data_type_code'の値は, [RFC2434]に記述されている プライベートな利用 (PRIVATE USE) に予約されている.

source: Furthermore, additional mechanisms mapping host names to certificates MAY be used and are left as implementation and configuration issues for implementers and system administrators.
ja: さらに, ホスト名と証明書をマッピングする追加のメカニズムが利用されてもよい. 実装者とシステム管理者に対して実装と設定の問題として残されている.

source: This section describes a modification to the generic GSS-API- authenticated Diffie-Hellman key exchange to allow the negotiation of the group to be used, using a method based on that described in [GROUP-EXCHANGE].
ja: この節では， [GROUP-EXCHANGE] で記述されたものをベースにした方法を用いて利用される群を交渉して決められるようにするための， 汎用GSS-APIで認証される Diffie-Hellman 鍵交換への変更を記述する．

source: to successfully complete the GSS-API method, while the client's last call to GSS_Init_sec_context() fails.
ja: この場合, クライアントの最後のGSS_Init_sec_context() 呼びだしが失敗しても, GSS-API 認証法をサーバが成功で終わらせることができる.

source: Such messages can be identified by their message numbers (see Section 6).
ja: メッセージは, そのメッセージ番号(6 節を参照)で識別される..

source: The associated Channel Connection Failure 'description' text is a human- readable message that describes the channel connection failure reason.
ja: 関連するチャンネル接続失敗の 'description' は, チャンネル接続失敗の理由を示す人間が解読できるメッセージだ.

source: Since the key exchange process will involve the exchange of only a single token once the context has been established, it is not necessary that the GSS-API context support detection of replayed or out-of-sequence tokens.
ja: 一度コンテクストが確立されると鍵交換プロセスは単一のトークンの交換のみ実行されるので, GSS-APIコンテクストは再送やシーケンスを外れたトークンの検出をサポートする必要はない.

source: The GSS-API authentication method is initiated when the client sends an SSH_MSG_USERAUTH_REQUEST:
ja: GSS-API 認証法はクライアントが SSH_MSG_USERAUTH_REQUEST を送ることで開始される．

source: In this case, different key types SHOULD be defined for the different policy alternatives.
ja: この場合, ポリシーの異なる選択肢に対しては異なる鍵の種類が定義されなければならない.

source: Security Considerations .........................................6 6.1.
ja: セキュリティの考察 .........................................6 6.1.

source: The following table lists the initial assignments of Public Key Subsystem Request names.
ja: 次の表で, 公開鍵サブシステムの要求名の初期の割り当てを示す.

source: It is intended that the coding be portable across different environments.
ja: これは, 異なる環境間でコードをポータブルにするためだ.

source: The client sends:
ja: クライアントは以下を送る.

source: The following example shows a capability exchange.
ja: 以下で機能の交換の例を示す.

source: AES-GCM produces a keystream in blocks of 16-octets that is used to encrypt the plaintext.
ja: AES-GCM は, 平文を暗号化するのに使われる再, 16-オクテットのブロックで鍵ストリームを生成する.

source: o The client has a local database that associates each host name (as typed by the user) with the corresponding public host key.
ja: o クライアントは, (ユーザによって入力された)ホスト名と関連するホスト鍵を結びつけるデータベースを持つ.

source: It defines an SSH user authentication method that uses a specified GSS-API mechanism to authenticate a user, and a family of SSH key exchange methods that use GSS-API to authenticate a Diffie-Hellman key exchange.
ja: ユーザを認証する特定のGSS-APIメカニズムを用いるSSHユーザ認証法と Diffie-Hellman 鍵交換を認証するためにGSS-APIを用いるSSHの鍵交換法のファミリを定義する.

source: Subject Header ......................................3 3.3.2.
ja: Subject ヘッダ ......................................3 3.3.2.

source: This protocol does allow the Data Integrity mechanism to be disabled.
ja: このプロトコルは, データの完全性のメカニズムを無効にすることを許している.

source: User authentication and protection against network-level attacks are assumed to be provided by the underlying protocols.
ja: ユーザ認証とネットワークレベルでの攻撃に対する対処は, 基底のプロトコルで提供されていることを仮定している.

source: o n is the size of the modulus p in bits that the client would like to receive from the server
ja: o n は， クライアントがサーバから受け取りたい法 p の bit でのサイズ

source: The only environment where the packet size increase is likely to have a significant effect is PPP [RFC1661] over slow modem lines (PPP compresses the TCP/IP headers, emphasizing the increase in packet size).
ja: パケットサイズの増大で重大な影響がでる可能性のある唯一の環境は, 遅いモデム回線でのPPP [RFC1661]だ (PPP は TCP/IPのヘッダを圧縮するので, パケットサイズの増大を強調する) .

source: S receives "e".
ja: S は "e" を受信する.

source: As with all other lines, each line in the body MUST NOT be longer than 72 8-bit bytes excluding line termination characters.
ja: 他の行と同様に, 本体の各行も行終端文字を除いて 72 8-bit バイトを越えてはならない.

source: Within the framework of SSH, the client does not have a long-term key pair that needs to be authenticated.
ja: SSHのフレームワークの中では, クライアントは認証に必要な長期間の鍵ペアを持たない.

source: value representation (hex) ----- -------------------- (), the empty name-list 00 00 00 00 ("zlib") 00 00 00 04 7a 6c 69 62 ("zlib,none") 00 00 00 09 7a 6c 69 62 2c 6e 6f 6e 65
ja: 値 表現 (hex) ----- -------------------- (), 空の name-list 00 00 00 00 ("zlib") 00 00 00 04 7a 6c 69 62 ("zlib,none") 00 00 00 09 7a 6c 69 62 2c 6e 6f 6e 65

source: * It is an error if the call does not produce a token of non- zero length to be sent to the server.
ja: * 呼び出しがサーバに送信される0でない長さのトークンを生成できなかったらエラーだ.

source: This version uses a 256-bit key.
ja: このバージョンは, 256-bitの鍵を用いる.

source: If there are no language preferences, this name-list SHOULD be empty as defined in Section 5 of [SSH-ARCH].
ja: 優先する言語がなければ, この名前リストは, [SSH-ARCH] の 5節で定義したように空の必要がある.

source: The subsystem name is "publickey".
ja: サブシステム名は "publickey" だ.

source: Encryption Algorithm Names ........................16 4.11.2.
ja: 暗号アルゴリズム名........................16 4.11.2.

source: In the absence of special purpose attacks exploiting the specific structure of the hash function, the difficulty of finding collisions, preimages, and second preimages for the hash function is related to the digest length.
ja: ハッシュ関数特有の構造を攻撃する特別な攻撃がなければ, そのハッシュ関数の衝突や原像, 第2原像の発見の難しさはダイジェストの長さに依存する.

source: Per-message context information is not accessible to Transport Models, so for the returned counter OID and value, contextEngine would be set to the local value of snmpEngineID and contextName to the default context for error counters.
ja: メッセージ単位のコンテキスト情報は, トランスポートモデルに対してアクセスできない. 返却されるカウンタ OID と値のために, contextEngine に対して snmpEngineID と contextName のローカルな値に エラーカウンタに対するデフォルトの context が設定される.

source: Starting a Shell or a Command
ja: シェルないしコマンドの起動

source: The following message numbers have been defined for use with the 'gssapi-with-mic' user authentication method:
ja: 'gssapi-with-mic' ユーザ認証法で用いるために, 以下のメッセージ番号が定義されている:

source: This document describes new symmetric encryption methods for the Secure Shell (SSH) Transport Protocol and gives specific recommendations on how frequently SSH implementations should rekey.
ja: この文書では, セキュアシェル (SSH) トランスポートプロトコルのための新しい対称暗号法を記述する. また, SSHの実装がどのくらいの頻度で鍵の再発行(rekey)すべきかの具体的な推奨を提供する.

source: It may or may not have a tty, and may or may not involve X11 forwarding.
ja: このプログラムは, ttyを持つかもしれないし持たないかもしれない. また, X11の転送を起動するかもしれないししないかもしれない.

source: The character/row dimensions override the pixel dimensions (when nonzero).
ja: 0以外の character/row 次元パラメータは, pixel 次元を上書きする.

source: Binding Encryption Keys
ja: 暗号鍵の束縛

source: Signing and verifying using this key format is done according to the Digital Signature Standard [FIPS-186-2] using the SHA-1 hash [FIPS-180-2].
ja: この鍵フォーマットでの署名と検証は, SHA-1 ハッシュ [FIPS-180-2] を用いるDigital Signature Standard [FIPS-186-2] に従って行なわれる.

source: If this is a client-side SSH session, then the tmTransportAddress is set to the tmTransportAddress used to establish the session.
ja: クライアント側の SSH のセッションの場合は, この tmTransportAddress は セッションを確立するために用いられた tmTransportAddress に設定される.

source: The status code is a byte value, describing the status of a request.
ja: 状態コードはバイトの値で, 要求の状態を記述する.

source: Notes about the PRIVATE USE Range ...................9 4.4.
ja: プライベートな利用(PRIVATE USE) の範囲についての注意.........9 4.4.

source: The SSH_MSG_USERAUTH_REQUEST packet refers to a service; this service name is an SSH service name and has no relationship to GSS-API service names.
ja: SSH_MSG_USERAUTH_REQUEST パケットはサービスを参照する. このサービス名は SSHのサービス名で GSS-APIのサービス名とは無関係だ.

source: Since the user authentication process by its nature authenticates only the client, the setting of mutual_req_flag is not needed for this process.
ja: ユーザ認証プロセスは， その性質上クライアントのみを認証するので，mutual_req_flag の設定はこのプロセスでは必要ない．

source: Note that a server MAY request that a user change the password.
ja: サーバはユーザにパスワードの変更を求める要求を送ってもよいことに注意.

source: For this attack (commonly known as the Rogaway attack [ROGAWAY], [DAI], [BELLARE]) to work, the attacker would need to know the Initialization Vector (IV) of the next block that is going to be encrypted.
ja: Rogaway attack [ROGAWAY], [DAI], [BELLARE] として知られるこの攻撃のためには, 攻撃者は次の暗号化されるブロックの初期化ベクトル(IV)を知る必要がある.

source: X11 display forwarding with SSH, by itself, is not sufficient to correct well known problems with X11 security [VENEMA].
ja: SSHによるX11ディスプレイの転送は, それ自体では, X11のセキュリティについて知られている問題 [VENEMA] を補正するのに十分ではない.

source: Key and Initialization Vector Derivation ..................10 5.
ja: 鍵と初期化ベクトルの導出 ..................10 5.

source: The server MUST respond with either SSH_MSG_USERAUTH_SUCCESS (if no more authentications are needed) or SSH_MSG_USERAUTH_FAILURE (if the request failed, or more authentications are needed).
ja: サーバは, 追加の認証が必要なければ SSH_MSG_USERAUTH_SUCCESS で, 認証要求が失敗したり追加の認証が必要な場合は SSH_MSG_USERAUTH_FAILURE で応答しなければならない.

source: Key exchange method names starting with "gss-" are reserved for key exchange methods that conform to this document; in particular, for those methods that use the GSS-API-authenticated Diffie-Hellman key exchange algorithm described in Section 2.1, including any future methods that use different groups and/or hash functions.
ja: "gss-" で始まる鍵交換法名は， この文書に適合する鍵交換法のために予約されている． 具体的には， 異なる群 かつ/もしくは ハッシュ関数を用いるすべての将来の方法を含む 2．1節で記述した GSS-APIで認証される Diffie-Hellman 鍵交換アルゴリズムを用いるその他の方法のために予約されている．

source: Once the SSH session has been established, the user (or application) will invoke NETCONF as an SSH subsystem called "netconf".
ja: SSHのセッションが確立したら, ユーザ(ないしアプリケーション)は, "netconf" SSHサブシステムとして NETCONF を起動する.

source: Naturally, if an attacker does attempt to replay a captured packet before the peers have rekeyed, then the receiver of the duplicate packet will not be able to validate the MAC and it will be discarded.
ja: 当然, ピアが鍵の再作成をする前に捕獲したパケットを攻撃者はリプレイしようとすると, 複製されたパケットの受け取り手はMACの検証に失敗しパケットは捨てられる.

source: The SNMP-TARGET-MIB and NOTIFICATION-MIB MIB modules may be configured using SNMP or other implementation-dependent mechanisms, such as CLI scripting or loading a configuration file.
ja: SNMP-TARGET-MIB と NOTIFICATION-MIB MIB モジュールは, SNMP や (CLI スクリプトや設定ファイルの読み込みのような)他の実装に独立なメカニズムを用いて設定されるだろう.

source: It is beyond the scope of this document and the Secure Shell Working Group to analyze or recommend specific ciphers other than the ones that have been established and accepted within the industry.
ja: 業界内で確立され受け入れられている暗号のうち, どれが優れているか分析したり優れた暗号を推奨することは, この文書やセキュアシェルワーキンググループの範囲を超えている.

source: In order to allow NETCONF traffic to be easily identified and filtered by firewalls and other network devices, NETCONF servers MUST default to providing access to the "netconf" SSH subsystem only when the SSH session is established using the IANA-assigned TCP port <830>.
ja: NETCONF のトラフィックを容易に識別しファイアウォールや他のネットワークデバイスでフィルタするために, NETCONF サーバは, IANA に割り当てられた TCP ポート <830> を用いて SSH のセッションが確立された場合のみ "netconf" SSH サブシステムへのアクセスを提供するのをデフォルトとしなければならない.

source: Formation of the Binary Packet .............................7 7.3.
ja: バイナリパケットの形成 .............................7 7.3.

source: As such, security considerations are discussed throughout.
ja: このため, セキュリティの考慮事項は全体にわたって議論されている.

source: As with any use of OCSP data, implementations SHOULD check that the production time of the OCSP response is acceptable.
ja: OCSP データを利用する場合は, 実装は, OCSP 応答の生成時間が受け入れられるかを検査する必要がある.

source: In the case of user authentication, the protection is not needed because the negotiation occurs over a secure channel, and the host's identity has already been proved to the user.
ja: ユーザ認証の場合もこの保護は必要ない. 安全なチャンネルの上で交渉が行なわれ, ホストの識別情報はユーザにすでに証明されている.

source: Implementations MUST allow the algorithm for each direction to be independently selected, if multiple algorithms are allowed by local policy.
ja: 実装は, ローカルなポリシーによって複数のアルゴリズムが許可されているならば, それぞれの方向のアルゴリズムが独立に選択されることを許さなければならない.

source: Managed objects are accessed via a virtual information store, termed the Management Information Base or MIB.
ja: 仮想情報ストアによる管理オブジェクトへのアクセスは, 管理情報ベースないしMIBを名付けられた.

source: Clients using protocol 2.0 MUST be able to identify this as identical to "2.0".
ja: プロトコル 2.0 を用いるクライアントは, 'protoversion' を "2.0" とできなければならない.

source: Opening the Public Key Subsystem
ja: 公開鍵サブシステムの開始

source: They MUST have only a single at-sign in them.
ja: 1つのアットマークだけが含まれなければならない.

source: If either side can't support the lower version, it should close the subsystem and notify the other side by sending an SSH_MSG_CHANNEL_CLOSE message.
ja: もう一方が低いバージョンをサポートしていなければ, サブシステムを終了させ, SSH_MSG_CHANNEL_CLOSE を送って相手側に通知しなければならない.

source: The service is identified by a name.
ja: サービスは名前で識別される.

source: The "diffie-hellman-group-exchange-sha1" method specifies Diffie-Hellman Group and Key Exchange with SHA-1 [FIPS-180-2] as HASH.
ja: "diffie-hellman-group-exchange-sha1" 法は, SHA-1 [FIPS-180-2] を HASH として用いる Diffie-Hellman 群と鍵交換を指定する.

source: When the service starts, it may have access to the session identifier generated during the key exchange.
ja: サービスを開始する場合は, 鍵交換の間に生成されたセッション識別子にアクセスするかもしれない.

source: GSS-API key exchange [RFC4462] provides a framework for the addition of client-authentication mechanisms that support different security infrastructures and provide different security properties.
ja: GSS-API 鍵交換 [RFC4462] は, 異なるセキュリティ基盤のサポートと異なるセキュリティ特性を提供するクライアント認証メカニズムの追加のためのフレームワークを提供する.

source: The Connection Protocol multiplexes the encrypted tunnel into several logical channels.
ja: コネクションプロトコルは暗号化されたトンネルをいくつかの論理的なチャンネルに多重化する.

source: The SnmpSSHAddress and tmSecurityName associated with an SSH session MUST remain constant during the life of the session.
ja: SSH に関連する SnmpSSHAddress と tmSecurityName は, セッションの有効期間中一定でなければならない.

source: It may be possible for the implementation to retrieve OCSP responses based on the id-ad-ocsp access description in the certificate's Authority Information Access data (Section 4.2.2.1 of [RFC5280]).
ja: 証明書の Authority Information Access データ ([RFC5280] の 4.2.2.1 節) の id-ad-ocsp access description に基いて OCSP 応答を実装が取得してもよい.

source: However, having that information available can be invaluable for debugging purposes.
ja: しかし, この情報は, デバッグのためには重要だ.

source: On many systems, it is possible to determine if a pseudo-terminal is using control-S/control-Q flow control.
ja: 多くのシステムで, 擬似ターミナルがControl-S/Control-Qのフロー制御を使うかどうかを決めることができる.

source: This process is used by any SNMP engine establishing a session for subsequent use.
ja: このプロセスは, その後の利用のためにセッションを確立するどのSNMP エンジンでも利用される.
